Revit.GeometryConversion.UnitConverter.ConvertRevitInternalUnitTypeIdToSupportedUnitTypeId(Autodesk.Revit.DB.ForgeTypeId)
Converts a Revit ForgeTypeId of type UnitTypeID to the subset of supported types that are available
in the ForgeUnitSDK.  There are a few special cases hardcoded into the Revit API that require a conversion.
For example, FeetFractionalInches would be converted to the ForgeUnitCLR.Unit type of Feet.
forgeTypeId: The UnitTypeId to convert
Returns: A UnitTypeId supported in ForgeUnitSDK